import React, {useState} from 'react';
import Navbar from './components/Navbar';
import Banner from './components/Banner';
import sec2Img from "../assets/images/sec-2.png";
import mapImg from "../assets/images/map.png";
import moon from "../assets/images/moon.svg"
import phone3Img from "../assets/images/phone_3.png"
import phone4Img from "../assets/images/phone_4.png"



const MainScreen = () => {
    const [openId, setOpenId] = useState(null);
    const questions = [
        {
            id: 1,
            question: "چرا استپ؟",
            answer : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و "
        },
        {
            id: 2,
            question: "نحوه کسب امتیازات چگونه است ؟",
            answer : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و "
        },
        {
            id: 3,
            question: "چگونه می‌توانم امتیازات بیشتری کسب کنم ؟",
            answer : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و "
        },
        {
            id: 4,
            question: "چه آماری پس از هر تمرین ذخیره می‌شود ؟",
            answer : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و "
        },
        {
            id: 5,
            question: "آیا استفاده از امکانات برنامه رایگان است  ؟",
            answer : "بله . درحال حاضر استفاده از تمامی امکانات برنامه اِستِپ رایگان می‌باشد ."
        },
    
    ]

    const toggle = (id) => {
        setOpenId(openId === id ? null : id);
    };
     
    return (
        <>
            <Navbar/>
            {/* banner */}
            <Banner/>
            <div className='peyda w-[80%] mx-auto md:grid md:grid-cols-2'>
                <div className='flex justify-center'>
                    <img src={sec2Img} className='w-[50%]'/>
                </div>
                
                <div className='flex flex-col justify-center'>
                    <h2 className='text-[#000066] text-[40px] peydaBlack w-[350px]'>
                        قدم‌هایت را به موفقیت تبدیل کن !
                    </h2>

                    <p className='text-[24px] text-[#606060] peydaBold text-justify mt-[24px]'>
اینجا تمام فعالیت‌های روزانه‌ات یک‌جا و شفاف نمایش داده می‌شه. لازم نیست چیزی رو حدس بزنی، فقط یه نگاه بنداز تا ببینی امروز چقدر حرکت کردی و چقدر مونده تا به هدفت برسی. ساده، جمع‌وجور و حال‌خوب‌کن طراحی شده، انگار یه رفیق همیشه همراهته که هی بهت میگه: دمت گرم، ادامه بده! هنوز جا داری رکورد بزنی! 
                    </p>
                </div>
            </div>


            {/* ================== */}

            <div className="bg-[#000066] text-[#F5F2FF] md:grid md:grid-cols-2 relative overflow-visible mt-[80px] min-h-[400px] md:min-h-[500px]">
                {/* ستون متن - سمت راست */}
                <div className="flex flex-col justify-center p-6 md:p-12">
                    <h2 className="peydaBlack text-3xl md:text-4xl lg:text-[42px] mb-6 leading-snug">
                    هر قدمت روی نقشه زنده میشه!
                    </h2>
                    <p className="text-[18px] md:text-[22px] text-[#DFDFDF] peydaBold text-justify leading-relaxed">
                    با قابلیت Live Tracking می‌تونی لحظه‌به‌لحظه مسیرت رو روی نقشه ببینی؛ چه در حال دویدن باشی، چه پیاده‌روی یا حتی کوه‌نوردی. مسیرت به‌صورت زنده ثبت میشه و هر قدم روی نقشه خودش رو نشون میده. تازه می‌تونی مسیرت رو با دوستات به اشتراک بذاری تا اون‌ها هم همراهت انگیزه بگیرن یا باهات رقابت کنن. این یعنی ورزش دیگه فقط حرکت نیست، یه ماجراجوییه که با استپ همیشه جلوی چشماته.
                    </p>
                </div>
            
                {/* ستون تصویر - سمت چپ */}
                <div className="relative flex items-center justify-center">
                    <img
                    src={mapImg}
                    alt="Map"
                    className="w-[90%] md:w-[85%] lg:w-[75%] drop-shadow-2xl rounded-2xl 
                                absolute top-1/2 -translate-y-1/2 left-10 md:left-16 lg:left-20"
                    />
                </div>
            </div>

            <div className='peyda mt-20 w-[80%] mx-auto md:grid md:grid-cols-2'>
                <div className=''>
                    <img src={phone3Img} className='w-[80%]'/>
                </div>
                
                <div className='flex flex-col justify-center relative'>
                    <h2 className='text-[#000066] text-[40px] peydaBlack w-[300px]'>
                        پیشرفتت رو به تصویر بکش!
                    </h2>

                    <p className='text-[24px] text-[#606060] peydaBold text-justify mt-[24px] md:w-[500px]'>
اینجا می‌تونی دقیق ببینی هر روز، هر هفته و هر ماه چقدر فعالیت کردی. نمودارها و آمار بهت نشون میده که پیشرفتت چطور داره جلو میره. خلاصه هیچ قدمی توی استپ گم نمیشه، همه‌اش ذخیره میشه تا همیشه جلوی چشمات باشه.                    </p>

                    <img 
                    src={moon} 
                    className="
                        hidden           /* hide by default (mobile) */
                        md:block         /* show from md and above (laptops) */
                        absolute
                        md:-left-20 md:top-20  /* position for laptops */
                        lg:top-16           /* adjust for larger screens */
                    " 
                    />


                </div>
            </div>

            {/* ==-=-=-=-=--=- */}
            <div className='peyda w-[80%] mx-auto md:grid md:grid-cols-2 mt-36'>
                <div className='flex flex-col justify-center'>
                    <h2 className='text-[#000066] text-[40px] peydaBlack w-[350px]'>
                        با دوستانت رقابت کن!
                    </h2>

                    <p className='text-[24px] text-[#606060] peydaBold text-justify mt-[24px] md:w-[600px]'>
ورزش تنهایی خوبه، ولی وقتی با بقیه رقابت کنی جذاب‌تر میشه! توی استپ می‌تونی رتبه خودت رو ببینی و با دوستات کل‌کل سالم داشته باشی. همین حس رقابت باعث میشه انگیزه‌ات چند برابر بشه و هیچ‌وقت کم نیاری.                    </p>
                </div>

                <div className='flex justify-center'>
                    <img src={phone4Img} className='w-[400px]'/>
                </div>
                
            </div>


            <hr className='my-16 w-[80%] mx-auto h-[2px] bg-[#E5DFFF] border border-[#E5DFFF] rounded-2xl'/>

            {/* questions */}
            <div className="flex justify-center w-full mb-36">
            <div className="w-[90%] md:w-[50%] lg:w-[50%]">
                <h1 className="peydaBlack text-[#202020] text-4xl mb-8 text-center">
                سوالات متداول
                </h1>

                <div className="grid grid-cols-1 gap-6 place-items-center">
                {questions.map((q) => (
                    <div
                    key={q.id}
                    onClick={() => toggle(q.id)}
                    className="cursor-pointer rounded-lg bg-[#ededed] p-6 w-full transition-all duration-300"
                    >
                    <div className="flex items-center justify-between">
                        <p
                        className={`peydaBold text-xl transition-colors duration-300 ${
                            openId === q.id ? "text-[#2E14B2]" : "text-[#404040]"
                        }`}
                        >
                        {q.question}
                        </p>
                        <svg
                        className={`transition-transform duration-300 ${
                            openId === q.id ? "rotate-180" : ""
                        }`}
                        width="24"
                        height="24"
                        viewBox="0 0 24 24"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                        >
                        <path
                            d="M12 16.7999C11.3 16.7999 10.6 16.5299 10.07 15.9999L3.55002 9.47989C3.26002 9.18989 3.26002 8.70989 3.55002 8.41989C3.84002 8.12989 4.32002 8.12989 4.61002 8.41989L11.13 14.9399C11.61 15.4199 12.39 15.4199 12.87 14.9399L19.39 8.41989C19.68 8.12989 20.16 8.12989 20.45 8.41989C20.74 8.70989 20.74 9.18989 20.45 9.47989L13.93 15.9999C13.4 16.5299 12.7 16.7999 12 16.7999Z"
                            fill={openId === q.id ? "#2E14B2" : "#606060"}
                        />
                        </svg>
                    </div>

                    <div
                        className={`overflow-hidden transition-all duration-500 ease-in-out ${
                        openId === q.id ? "max-h-96 mt-4" : "max-h-0"
                        }`}
                    >
                        <p className="peyda text-[#404040] text-base text-right">
                        {q.answer}
                        </p>
                    </div>
                    </div>
                ))}
                </div>
            </div>
            </div>


            {/* =================================== */}
            {/* footer */}
            <footer className='bg-[#2F3C50] peyda p-8'>
                <div className='w-[80%] mx-auto relative'>
                    {/* top arrow */}
                    <a 
                    href='#' 
                    onClick={(e) => {
                        e.preventDefault(); // Prevent the default anchor behavior
                        window.scrollTo({
                        top: 0, // Scroll to the top of the page
                        behavior: 'smooth' // Enable smooth scrolling
                        });
                    }} 
                    className='w-12 h-12 rounded-full bg-[#FBF7FF] absolute left-[50%] right-[50%] -top-24 flex justify-center items-center'
                    >
                    <div className='w-[37px] h-[37px] border-2 border-[#404040] rounded-full flex justify-center items-center'>
                        <svg width="16" height="9" viewBox="0 0 16 9" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M14.9424 7.88452L8.00038 0.912521L1.05838 7.88452" stroke="#404040" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                        </svg>
                    </div>
                    </a>

                    {/* top footer */}
                    <div className='md:grid md:grid-cols-3 mt-10'>
                        <a href='/'>
                            <svg width="177" height="64" viewBox="0 0 177 64" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M2.67063 12.92H9.03063L8.39063 29.8H3.27063L2.67063 12.92ZM3.15063 34.28H8.51063V40H3.15063V34.28ZM26.3619 49.8H31.3619V44.8H26.3619V49.8ZM33.4419 49.8H38.4419V44.8H33.4419V49.8ZM29.8019 56.28H34.8019V51.28H29.8019V56.28ZM21.9619 23.88V31.2C21.9619 32.0267 22.2419 32.7333 22.8019 33.32C23.3885 33.88 24.1085 34.16 24.9619 34.16H41.5219C41.9752 34.16 42.3485 34.0133 42.6419 33.72C42.9619 33.4 43.1219 33.0267 43.1219 32.6V25.04H48.0819V32.56C48.0819 33.0133 48.2285 33.4 48.5219 33.72C48.8419 34.04 49.2285 34.2 49.6819 34.2H50.8419C51.2419 34.2 51.4419 34.3867 51.4419 34.76V39.44C51.4419 39.5733 51.3752 39.7067 51.2419 39.84C51.1352 39.9467 51.0019 40 50.8419 40H50.5219C48.5485 40 46.9219 39.2533 45.6419 37.76C44.9485 38.5333 44.1752 39.1067 43.3219 39.48C42.4952 39.8267 41.6019 40 40.6419 40H25.4419C24.2685 40 23.1619 39.7867 22.1219 39.36C21.1085 38.9067 20.2152 38.2933 19.4419 37.52C18.6952 36.7467 18.0952 35.8533 17.6419 34.84C17.2152 33.8 17.0019 32.7067 17.0019 31.56V23.88H21.9619ZM51.5872 48.92L65.2272 46L66.1472 50.16L52.3072 53.08L51.5872 48.92ZM51.9794 21.84H56.9794V16.84H51.9794V21.84ZM59.0594 21.84H64.0594V16.84H59.0594V21.84ZM66.8594 39.44C66.8594 39.5733 66.806 39.7067 66.6994 39.84C66.5927 39.9467 66.4594 40 66.2994 40H63.0594C62.2327 40 61.406 39.8 60.5794 39.4C59.7794 39 59.1794 38.4533 58.7794 37.76C58.2727 38.4533 57.5794 39 56.6994 39.4C55.846 39.8 54.9927 40 54.1394 40H50.8594C50.726 40 50.606 39.9467 50.4994 39.84C50.366 39.7333 50.2994 39.6 50.2994 39.44V34.76C50.2994 34.6 50.366 34.4667 50.4994 34.36C50.606 34.2267 50.726 34.16 50.8594 34.16H54.6194C55.0727 34.16 55.4727 34.0267 55.8194 33.76C56.166 33.4667 56.3794 33.0933 56.4594 32.64L58.0194 25.12L62.8594 26L61.6194 32.32C61.5127 32.8267 61.606 33.2667 61.8994 33.64C62.1927 33.9867 62.5927 34.16 63.0994 34.16H66.2994C66.4594 34.16 66.5927 34.2267 66.6994 34.36C66.806 34.4667 66.8594 34.6 66.8594 34.76V39.44ZM77.2091 40C76.2491 40 75.3424 39.8267 74.4891 39.48C73.6624 39.1067 72.9291 38.5333 72.2891 37.76C71.5957 38.5333 70.8224 39.1067 69.9691 39.48C69.1424 39.8267 68.2491 40 67.2891 40H66.2891C66.1291 40 65.9957 39.9467 65.8891 39.84C65.7824 39.7067 65.7291 39.5733 65.7291 39.44V34.76C65.7291 34.6 65.7957 34.4667 65.9291 34.36C66.0357 34.2267 66.1557 34.16 66.2891 34.16H68.2091C68.6624 34.16 69.0357 34 69.3291 33.68C69.6491 33.3333 69.8091 32.9333 69.8091 32.48V25.04H74.7291V32.48C74.7291 32.9333 74.8757 33.3333 75.1691 33.68C75.4891 34 75.8757 34.16 76.3291 34.16H77.5691C78.0224 34.16 78.4224 34.0267 78.7691 33.76C79.1157 33.4667 79.3424 33.0933 79.4491 32.64L80.9691 25.12L85.9291 26L84.6491 32.28C84.5424 32.7333 84.6491 33.16 84.9691 33.56C85.2891 33.96 85.6757 34.16 86.1291 34.16H89.2491V24H94.2091V34.68C94.2091 35.4 94.0624 36.08 93.7691 36.72C93.5024 37.36 93.1157 37.9333 92.6091 38.44C92.1291 38.92 91.5691 39.3067 90.9291 39.6C90.2891 39.8667 89.6091 40 88.8891 40H86.1291C85.2757 40 84.4891 39.8267 83.7691 39.48C83.0491 39.1333 82.3957 38.5467 81.8091 37.72C81.1691 38.5733 80.4491 39.1733 79.6491 39.52C78.8757 39.84 78.0624 40 77.2091 40ZM92.6028 48.92L106.243 46L107.163 50.16L93.3228 53.08L92.6028 48.92ZM102.938 40H97.9784V12.24H102.938V40Z" fill="#BDB0FF"/>
                            <path d="M135.627 28.7191C135.875 28.6521 136.133 28.7817 136.217 29.0241C137.286 32.0946 138.134 37.5291 134.89 38.7024C128.744 40.9699 126.694 33.7825 126.223 31.7832C126.159 31.5117 126.332 31.2313 126.601 31.1585L135.627 28.7191ZM124.961 29.078C125.074 29.3024 125.335 29.425 125.579 29.3646L135.11 27.0039C135.366 26.9405 135.527 26.6891 135.494 26.4275C135.19 24.0494 135.806 21.6466 135.806 18.8401C135.806 14.7906 132.6 6.86012 127.49 8.13767C121.657 9.58394 120.813 16.0681 121.03 19.2017C121.285 21.9696 124.174 27.521 124.961 29.078ZM154.424 47.8538C154.685 47.9169 154.849 48.1698 154.783 48.43C154.28 50.4124 151.951 57.8379 145.761 55.5756C142.536 54.3778 143.626 49.0178 144.718 45.957C144.802 45.7201 145.053 45.5902 145.297 45.6493L154.424 47.8538ZM159.597 36.075C159.838 32.9414 159.019 26.4331 153.161 24.9868C148.075 23.6611 144.869 31.6397 144.869 35.7134C144.869 38.5004 145.466 40.904 145.197 43.2845C145.168 43.5429 145.329 43.7885 145.581 43.8513L155.092 46.2181C155.328 46.2767 155.576 46.1641 155.686 45.9482C156.47 44.4211 159.362 38.8341 159.597 36.075Z" fill="#BDB0FF"/>
                            </svg>

                        </a>
                        <p className='text-xl text-[#ededed] text-justify md:col-span-2 md:w-[800px]'>
                            استپ، همراه هوشمند تو در مسیر سلامتی و پیشرفت. قدم به قدم کنارته تا انگیزه بگیری، حرکت کنی و سبک زندگی سالم‌تری بسازی.
                        </p>
                    </div>
                    {/* bottom footer */}
                    <div className='mt-14'>
                        <div className='md:flex md:items-center md:justify-between'>
                            <div>
                                <p className='text-xl peydaBold text-[#ededed] mb-4'>
                                    ارتباط با ما
                                </p>
                                <p className='flex items-center gap-2 text-[12px] text-[#dfdfdf]'>
                                     <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M11.6335 15.1668C10.8802 15.1668 10.0868 14.9868 9.26683 14.6402C8.46683 14.3002 7.66016 13.8335 6.8735 13.2668C6.0935 12.6935 5.34016 12.0535 4.62683 11.3535C3.92016 10.6402 3.28016 9.88683 2.7135 9.1135C2.14016 8.3135 1.68016 7.5135 1.3535 6.74016C1.00683 5.9135 0.833496 5.1135 0.833496 4.36016C0.833496 3.84016 0.926829 3.34683 1.10683 2.88683C1.2935 2.4135 1.5935 1.9735 2.00016 1.5935C2.5135 1.08683 3.10016 0.833496 3.72683 0.833496C3.98683 0.833496 4.2535 0.893496 4.48016 1.00016C4.74016 1.12016 4.96016 1.30016 5.12016 1.54016L6.66683 3.72016C6.80683 3.9135 6.9135 4.10016 6.98683 4.28683C7.0735 4.48683 7.12016 4.68683 7.12016 4.88016C7.12016 5.1335 7.04683 5.38016 6.90683 5.6135C6.80683 5.7935 6.6535 5.98683 6.46016 6.18016L6.00683 6.6535C6.0135 6.6735 6.02016 6.68683 6.02683 6.70016C6.10683 6.84016 6.26683 7.08016 6.5735 7.44016C6.90016 7.8135 7.20683 8.1535 7.5135 8.46683C7.90683 8.8535 8.2335 9.16016 8.54016 9.4135C8.92016 9.7335 9.16683 9.8935 9.3135 9.96683L9.30016 10.0002L9.78683 9.52016C9.9935 9.3135 10.1935 9.16016 10.3868 9.06016C10.7535 8.8335 11.2202 8.7935 11.6868 8.98683C11.8602 9.06016 12.0468 9.16016 12.2468 9.30016L14.4602 10.8735C14.7068 11.0402 14.8868 11.2535 14.9935 11.5068C15.0935 11.7602 15.1402 11.9935 15.1402 12.2268C15.1402 12.5468 15.0668 12.8668 14.9268 13.1668C14.7868 13.4668 14.6135 13.7268 14.3935 13.9668C14.0135 14.3868 13.6002 14.6868 13.1202 14.8802C12.6602 15.0668 12.1602 15.1668 11.6335 15.1668ZM3.72683 1.8335C3.36016 1.8335 3.02016 1.9935 2.6935 2.3135C2.38683 2.60016 2.1735 2.9135 2.04016 3.2535C1.90016 3.60016 1.8335 3.96683 1.8335 4.36016C1.8335 4.98016 1.98016 5.6535 2.2735 6.34683C2.5735 7.0535 2.9935 7.78683 3.52683 8.52016C4.06016 9.2535 4.66683 9.96683 5.3335 10.6402C6.00016 11.3002 6.72016 11.9135 7.46016 12.4535C8.18016 12.9802 8.92016 13.4068 9.6535 13.7135C10.7935 14.2002 11.8602 14.3135 12.7402 13.9468C13.0802 13.8068 13.3802 13.5935 13.6535 13.2868C13.8068 13.1202 13.9268 12.9402 14.0268 12.7268C14.1068 12.5602 14.1468 12.3868 14.1468 12.2135C14.1468 12.1068 14.1268 12.0002 14.0735 11.8802C14.0535 11.8402 14.0135 11.7668 13.8868 11.6802L11.6735 10.1068C11.5402 10.0135 11.4202 9.94683 11.3068 9.90016C11.1602 9.84016 11.1002 9.78016 10.8735 9.92016C10.7402 9.98683 10.6202 10.0868 10.4868 10.2202L9.98016 10.7202C9.72016 10.9735 9.32016 11.0335 9.0135 10.9202L8.8335 10.8402C8.56016 10.6935 8.24016 10.4668 7.88683 10.1668C7.56683 9.8935 7.22016 9.5735 6.80016 9.16016C6.4735 8.82683 6.14683 8.4735 5.80683 8.08016C5.4935 7.7135 5.26683 7.40016 5.12683 7.14016L5.04683 6.94016C5.00683 6.78683 4.9935 6.70016 4.9935 6.60683C4.9935 6.36683 5.08016 6.1535 5.24683 5.98683L5.74683 5.46683C5.88016 5.3335 5.98016 5.20683 6.04683 5.0935C6.10016 5.00683 6.12016 4.9335 6.12016 4.86683C6.12016 4.8135 6.10016 4.7335 6.06683 4.6535C6.02016 4.54683 5.94683 4.42683 5.8535 4.30016L4.30683 2.1135C4.24016 2.02016 4.16016 1.9535 4.06016 1.90683C3.9535 1.86016 3.84016 1.8335 3.72683 1.8335ZM9.30016 10.0068L9.1935 10.4602L9.3735 9.9935C9.34016 9.98683 9.3135 9.9935 9.30016 10.0068Z" fill="#ADADAD"/>
                                    </svg>
                                     شماره تماس: +989224850196
                                </p>
                                <p className='flex items-center gap-2 text-[12px] text-[#dfdfdf] mt-4'>
                                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M11.3335 14.1668H4.66683C2.2335 14.1668 0.833496 12.7668 0.833496 10.3335V5.66683C0.833496 3.2335 2.2335 1.8335 4.66683 1.8335H11.3335C13.7668 1.8335 15.1668 3.2335 15.1668 5.66683V10.3335C15.1668 12.7668 13.7668 14.1668 11.3335 14.1668ZM4.66683 2.8335C2.76016 2.8335 1.8335 3.76016 1.8335 5.66683V10.3335C1.8335 12.2402 2.76016 13.1668 4.66683 13.1668H11.3335C13.2402 13.1668 14.1668 12.2402 14.1668 10.3335V5.66683C14.1668 3.76016 13.2402 2.8335 11.3335 2.8335H4.66683Z" fill="#ADADAD"/>
                                    <path d="M7.99969 8.57998C7.43969 8.57998 6.87302 8.40665 6.43969 8.05331L4.35302 6.38665C4.13969 6.21331 4.09969 5.89998 4.27302 5.68665C4.44636 5.47331 4.75969 5.43332 4.97303 5.60665L7.05969 7.27332C7.56635 7.67998 8.42635 7.67998 8.93302 7.27332L11.0197 5.60665C11.233 5.43332 11.553 5.46665 11.7197 5.68665C11.893 5.89998 11.8597 6.21998 11.6397 6.38665L9.55302 8.05331C9.12636 8.40665 8.55969 8.57998 7.99969 8.57998Z" fill="#ADADAD"/>
                                    </svg>
                                    ایمیل: step.run.app@gmail.com
                                </p>

                            </div>
                            <div className='grid grid-cols-2'>
                                {/* right side */}
                                <div>
                                    <p className='peydaBold text-xl text-[#ededed] mb-[27px] text-center'>
                                        استپ در شبکه های اجتماعی
                                    </p>
                                    <div className='flex items-center justify-center gap-4'>
                                        {/* Linkdin */}
                                        <a href='#linkdin'>
                                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <g clip-path="url(#clip0_3378_7345)">
                                                <path d="M0.5 4.26892C0.5 3.2393 0.860371 2.38988 1.58108 1.72066C2.30179 1.05141 3.23875 0.716797 4.39189 0.716797C5.52446 0.716797 6.44079 1.04625 7.14093 1.70521C7.86164 2.38475 8.22201 3.27019 8.22201 4.36158C8.22201 5.35 7.87195 6.17366 7.17181 6.83263C6.4511 7.51216 5.50386 7.85193 4.33012 7.85193H4.29923C3.16666 7.85193 2.25033 7.51216 1.55019 6.83263C0.850054 6.15309 0.5 5.29851 0.5 4.26892ZM0.901544 31.2959V10.6627H7.75869V31.2959H0.901544ZM11.5579 31.2959H18.4151V19.7747C18.4151 19.054 18.4974 18.498 18.6622 18.1068C18.9504 17.4066 19.388 16.8146 19.9749 16.3307C20.5618 15.8468 21.2979 15.6048 22.1834 15.6048C24.4897 15.6048 25.6429 17.1595 25.6429 20.2689V31.2959H32.5V19.4658C32.5 16.4182 31.7793 14.1068 30.3378 12.5315C28.8964 10.9562 26.9916 10.1685 24.6236 10.1685C21.9672 10.1685 19.8977 11.3114 18.4151 13.5971V13.6589H18.3842L18.4151 13.5971V10.6627H11.5579C11.5991 11.3217 11.6197 13.3706 11.6197 16.8095C11.6197 20.2483 11.5991 25.0771 11.5579 31.2959Z" fill="#0A66C2"/>
                                                </g>
                                                <defs>
                                                <clipPath id="clip0_3378_7345">
                                                <rect width="32" height="32" fill="white" transform="translate(0.5)"/>
                                                </clipPath>
                                                </defs>
                                            </svg>
                                        </a>
                                        {/* instagram */}
                                        <a href='#instagram'>
                                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M32.4102 9.40272C32.3334 7.69896 32.0582 6.53323 31.6677 5.51481C31.258 4.46437 30.7139 3.56765 29.8241 2.68375C28.9343 1.79984 28.0445 1.24259 26.9947 0.839071C25.9769 0.441954 24.8119 0.172938 23.1092 0.0960769C21.4 0.0192154 20.8559 0 16.5158 0C12.1694 0 11.6253 0.0192154 9.92252 0.0960769C8.21978 0.172938 7.05475 0.448359 6.03695 0.839071C4.98074 1.249 4.08456 1.79343 3.20118 2.68375C2.3178 3.57406 1.76089 4.46437 1.35761 5.51481C0.967133 6.53323 0.691878 7.69896 0.615062 9.40272C0.538247 11.1129 0.519043 11.6573 0.519043 16C0.519043 20.3491 0.538247 20.8935 0.615062 22.5973C0.691878 24.301 0.967133 25.4668 1.35761 26.4852C1.76729 27.5356 2.3114 28.4323 3.20118 29.3163C4.08456 30.2066 4.98074 30.7574 6.03055 31.1609C7.04835 31.558 8.21338 31.8271 9.91612 31.9039C11.6253 31.9808 12.1694 32 16.5094 32C20.8559 32 21.4 31.9808 23.1028 31.9039C24.8055 31.8271 25.9705 31.5516 26.9883 31.1609C28.0381 30.751 28.9343 30.2066 29.8177 29.3163C30.7011 28.4259 31.258 27.5356 31.6613 26.4852C32.0582 25.4668 32.327 24.301 32.4038 22.5973C32.4806 20.8871 32.4998 20.3427 32.4998 16C32.4998 11.6573 32.487 11.1065 32.4102 9.40272ZM29.536 22.4692C29.4656 24.032 29.2032 24.8839 28.9855 25.4412C28.6975 26.1841 28.3454 26.7222 27.7821 27.2858C27.2188 27.8495 26.6875 28.189 25.9385 28.49C25.3752 28.7078 24.5238 28.9704 22.9683 29.0408C21.2848 29.1177 20.7791 29.1369 16.503 29.1369C12.227 29.1369 11.7213 29.1177 10.0377 29.0408C8.47583 28.9704 7.62446 28.7078 7.06755 28.49C6.325 28.2018 5.7873 27.8495 5.22398 27.2858C4.66067 26.7222 4.3214 26.1906 4.02054 25.4412C3.8029 24.8775 3.54045 24.0256 3.47003 22.4692C3.39322 20.7846 3.37401 20.2786 3.37401 16C3.37401 11.7214 3.39322 11.2154 3.47003 9.53082C3.54045 7.96797 3.8029 7.11609 4.02054 6.55885C4.3086 5.81585 4.66067 5.27782 5.22398 4.71417C5.7873 4.15052 6.3186 3.81105 7.06755 3.51001C7.63087 3.29223 8.48224 3.02962 10.0377 2.95917C11.7213 2.88231 12.227 2.86309 16.503 2.86309C20.7791 2.86309 21.2848 2.88231 22.9683 2.95917C24.5302 3.02962 25.3816 3.29223 25.9385 3.51001C26.6811 3.79824 27.2188 4.15052 27.7821 4.71417C28.3454 5.27782 28.6847 5.80945 28.9855 6.55885C29.2032 7.1225 29.4656 7.97438 29.536 9.53082C29.6129 11.2154 29.6321 11.7214 29.6321 16C29.6321 20.2786 29.6065 20.7846 29.536 22.4692Z" fill="url(#paint0_linear_3378_603)"/>
                                                <path d="M16.5029 7.77588C11.958 7.77588 8.28369 11.4588 8.28369 16.0001C8.28369 20.5477 11.9644 24.2242 16.5029 24.2242C21.0414 24.2242 24.7222 20.5349 24.7222 16.0001C24.7222 11.4524 21.0478 7.77588 16.5029 7.77588ZM16.5029 21.3355C13.5583 21.3355 11.1707 18.9464 11.1707 16.0001C11.1707 13.0537 13.5583 10.6646 16.5029 10.6646C19.4475 10.6646 21.8352 13.0537 21.8352 16.0001C21.8352 18.9464 19.4475 21.3355 16.5029 21.3355Z" fill="url(#paint1_linear_3378_603)"/>
                                                <path d="M25.0425 9.37725C26.1031 9.37725 26.9628 8.51695 26.9628 7.45572C26.9628 6.39448 26.1031 5.53418 25.0425 5.53418C23.9819 5.53418 23.1221 6.39448 23.1221 7.45572C23.1221 8.51695 23.9819 9.37725 25.0425 9.37725Z" fill="#BC30A0"/>
                                                <path d="M0.5 16C0.5 20.3491 0.519204 20.8935 0.596019 22.5973C0.672835 24.301 0.94809 25.4668 1.33857 26.4852C1.74825 27.5356 2.29236 28.4323 3.18214 29.3163C4.06551 30.2002 4.96169 30.7574 6.0115 31.1609C7.02931 31.558 8.19434 31.8271 9.89708 31.9039C11.6062 31.9808 12.1503 32 16.4904 32C20.8369 32 21.381 31.9808 23.0837 31.9039C24.7865 31.8271 25.9515 31.5516 26.9693 31.1609C28.0191 30.751 28.9153 30.2066 29.7987 29.3163C30.682 28.4323 31.2389 27.5356 31.6422 26.4852C32.0391 25.4668 32.308 24.301 32.3848 22.5973C32.4616 20.8871 32.4808 20.3427 32.4808 16C32.4808 11.6509 32.4616 11.1065 32.3848 9.40272C32.308 7.69896 32.0327 6.53323 31.6422 5.51481C31.2325 4.46437 30.6884 3.56765 29.7987 2.68375C28.9217 1.79343 28.0255 1.24259 26.9757 0.839071C25.9579 0.441954 24.7929 0.172938 23.0901 0.0960769C21.381 0.0192154 20.8369 0 16.4968 0C12.1503 0 11.6062 0.0192154 9.90348 0.0960769C8.20074 0.172938 7.03571 0.448359 6.0179 0.839071C4.96809 1.249 4.07191 1.79343 3.18854 2.68375C2.30516 3.57406 1.74825 4.46437 1.34497 5.51481C0.94809 6.53323 0.672835 7.69896 0.596019 9.40272C0.519204 11.1065 0.5 11.6509 0.5 16ZM3.38698 16C3.38698 11.7278 3.40618 11.2154 3.483 9.53082C3.55341 7.96797 3.81586 7.11609 4.03351 6.55885C4.32156 5.81585 4.67363 5.27782 5.23695 4.71417C5.80026 4.15052 6.33157 3.81105 7.08052 3.51001C7.64383 3.29223 8.4952 3.02962 10.0507 2.95917C11.7342 2.88231 12.2399 2.86309 16.516 2.86309C20.7921 2.86309 21.2978 2.88231 22.9813 2.95917C24.5432 3.02962 25.3946 3.29223 25.9515 3.51001C26.694 3.79824 27.2317 4.15052 27.7951 4.71417C28.3584 5.27782 28.6976 5.80945 28.9985 6.55885C29.2161 7.1225 29.4786 7.97438 29.549 9.53082C29.6258 11.2154 29.645 11.7214 29.645 16C29.645 20.2786 29.6258 20.7846 29.549 22.4692C29.4786 24.032 29.2161 24.8839 28.9985 25.4412C28.7104 26.1841 28.3584 26.7222 27.7951 27.2858C27.2317 27.8495 26.7004 28.189 25.9515 28.49C25.3882 28.7078 24.5368 28.9704 22.9813 29.0408C21.2978 29.1177 20.7921 29.1369 16.516 29.1369C12.2399 29.1369 11.7342 29.1177 10.0507 29.0408C8.4888 28.9704 7.63743 28.7078 7.08052 28.49C6.33797 28.2018 5.80026 27.8495 5.23695 27.2858C4.67363 26.7222 4.33437 26.1906 4.03351 25.4412C3.81586 24.8775 3.55341 24.0256 3.483 22.4692C3.39978 20.7846 3.38698 20.2722 3.38698 16Z" fill="url(#paint2_linear_3378_603)"/>
                                                <defs>
                                                <linearGradient id="paint0_linear_3378_603" x1="27.5605" y1="2.44694" x2="4.41056" y2="30.8102" gradientUnits="userSpaceOnUse">
                                                <stop stop-color="#AE3DAE"/>
                                                <stop offset="0.0468721" stop-color="#B23BA6"/>
                                                <stop offset="0.1216" stop-color="#BD368E"/>
                                                <stop offset="0.2148" stop-color="#CE2E69"/>
                                                <stop offset="0.3216" stop-color="#E62335"/>
                                                <stop offset="0.418" stop-color="#FF1800"/>
                                                </linearGradient>
                                                <linearGradient id="paint1_linear_3378_603" x1="20.4227" y1="9.40387" x2="12.0129" y2="23.5353" gradientUnits="userSpaceOnUse">
                                                <stop stop-color="#E12F6A"/>
                                                <stop offset="0.1705" stop-color="#EA3751"/>
                                                <stop offset="0.3563" stop-color="#F13D3E"/>
                                                <stop offset="0.5467" stop-color="#F64133"/>
                                                <stop offset="0.7469" stop-color="#F7422F"/>
                                                <stop offset="0.7946" stop-color="#F74C2F"/>
                                                <stop offset="0.8743" stop-color="#F7652F"/>
                                                <stop offset="0.9757" stop-color="#F78F2E"/>
                                                <stop offset="1" stop-color="#F79A2E"/>
                                                </linearGradient>
                                                <linearGradient id="paint2_linear_3378_603" x1="23.7508" y1="-1.31737" x2="9.58519" y2="32.4484" gradientUnits="userSpaceOnUse">
                                                <stop offset="0.2341" stop-color="#9E35A5" stop-opacity="0"/>
                                                <stop offset="0.4512" stop-color="#D42F7F" stop-opacity="0.5"/>
                                                <stop offset="0.7524" stop-color="#F7772E"/>
                                                <stop offset="0.9624" stop-color="#FEF780"/>
                                                </linearGradient>
                                                </defs>
                                            </svg>
                                        </a>
                                        {/* telegram */}
                                        <a href='#telegram'>
                                            <svg width="33" height="32" viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path fill-rule="evenodd" clip-rule="evenodd" d="M3.21619 15.0578C11.4848 11.4552 16.9986 9.08025 19.7574 7.93277C27.6343 4.65648 29.2711 4.08735 30.3379 4.06856C30.5725 4.06443 31.0972 4.12258 31.437 4.39833C31.724 4.63117 31.8029 4.9457 31.8407 5.16646C31.8785 5.38721 31.9255 5.8901 31.8881 6.28305C31.4613 10.768 29.6143 21.6519 28.6746 26.6752C28.277 28.8007 27.4941 29.5134 26.7362 29.5832C25.0891 29.7347 23.8383 28.4946 22.243 27.4489C19.7466 25.8124 18.3363 24.7938 15.9131 23.1969C13.1127 21.3515 14.9281 20.3372 16.524 18.6796C16.9417 18.2458 24.199 11.6447 24.3395 11.0459C24.3571 10.971 24.3734 10.6918 24.2075 10.5444C24.0417 10.397 23.7969 10.4474 23.6203 10.4875C23.3699 10.5443 19.3819 13.1803 11.6562 18.3953C10.5242 19.1726 9.49891 19.5513 8.58026 19.5315C7.56752 19.5096 5.61942 18.9589 4.17121 18.4881C2.39492 17.9107 0.983163 17.6054 1.1061 16.6248C1.17013 16.1141 1.87349 15.5917 3.21619 15.0578Z" fill="url(#paint0_linear_3338_29970)"/>
                                                <defs>
                                                <linearGradient id="paint0_linear_3338_29970" x1="16.5002" y1="4.06836" x2="16.5002" y2="29.4065" gradientUnits="userSpaceOnUse">
                                                <stop stop-color="#2AABEE"/>
                                                <stop offset="1" stop-color="#229ED9"/>
                                                </linearGradient>
                                                </defs>
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                                {/* left side */}
                                <div>
                                    <p className='peydaBold text-xl text-[#ededed] mb-[27px] text-center'>
                                        دانلود اِستِپ
                                    </p>
                                    <div className='flex items-center justify-center gap-4'>
                                        {/* play store */}
                                        <a href='#playStore'>
                                            <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M0.642646 0.494001C0.235578 0.876568 0 1.47219 0 2.24355V29.7573C0 30.5287 0.235578 31.1243 0.642646 31.5068L0.743115 31.5908L17.9162 16.1793V15.8154L0.743115 0.403805L0.642646 0.494001Z" fill="url(#paint0_linear_3338_29966)"/>
                                                <path d="M23.6345 21.3188L17.9165 16.1791V15.8152L23.6414 10.6754L23.7696 10.7423L30.5495 14.2056C32.4843 15.1884 32.4843 16.8058 30.5495 17.7949L23.7696 21.252L23.6345 21.3188Z" fill="url(#paint1_linear_3338_29966)"/>
                                                <path d="M23.7697 21.2523L17.9166 15.9974L0.643066 31.5069C1.28571 32.1134 2.3337 32.1865 3.52545 31.58L23.7697 21.2523Z" fill="url(#paint2_linear_3338_29966)"/>
                                                <path d="M23.7697 10.7427L3.52545 0.414942C2.3337 -0.185347 1.28571 -0.112257 0.643066 0.494252L17.9166 15.9976L23.7697 10.7427Z" fill="url(#paint3_linear_3338_29966)"/>
                                                <defs>
                                                <linearGradient id="paint0_linear_3338_29966" x1="16.3914" y1="30.0438" x2="-4.36715" y2="6.92193" gradientUnits="userSpaceOnUse">
                                                <stop stop-color="#00A0FF"/>
                                                <stop offset="0.0066" stop-color="#00A1FF"/>
                                                <stop offset="0.2601" stop-color="#00BEFF"/>
                                                <stop offset="0.5122" stop-color="#00D2FF"/>
                                                <stop offset="0.7604" stop-color="#00DFFF"/>
                                                <stop offset="1" stop-color="#00E3FF"/>
                                                </linearGradient>
                                                <linearGradient id="paint1_linear_3338_29966" x1="33.069" y1="15.9954" x2="-0.462171" y2="15.9954" gradientUnits="userSpaceOnUse">
                                                <stop stop-color="#FFE000"/>
                                                <stop offset="0.4087" stop-color="#FFBD00"/>
                                                <stop offset="0.7754" stop-color="#FFA500"/>
                                                <stop offset="1" stop-color="#FF9C00"/>
                                                </linearGradient>
                                                <linearGradient id="paint2_linear_3338_29966" x1="20.587" y1="13.1408" x2="-7.56334" y2="-18.2144" gradientUnits="userSpaceOnUse">
                                                <stop stop-color="#FF3A44"/>
                                                <stop offset="1" stop-color="#C31162"/>
                                                </linearGradient>
                                                <linearGradient id="paint3_linear_3338_29966" x1="-3.70504" y1="40.6608" x2="8.86534" y2="26.6594" gradientUnits="userSpaceOnUse">
                                                <stop stop-color="#32A071"/>
                                                <stop offset="0.0685" stop-color="#2DA771"/>
                                                <stop offset="0.4762" stop-color="#15CF74"/>
                                                <stop offset="0.8009" stop-color="#06E775"/>
                                                <stop offset="1" stop-color="#00F076"/>
                                                </linearGradient>
                                                </defs>
                                            </svg>
                                        </a>
                                        {/* apple store */}
                                        <a href='#appleStore'>
                                            <svg width="26" height="32" viewBox="0 0 26 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M21.716 17.0175C21.6796 12.9748 25.0217 11.008 25.1745 10.9165C23.2818 8.15316 20.3481 7.77561 19.3171 7.74551C16.8532 7.48586 14.4631 9.22186 13.208 9.22186C11.9278 9.22186 9.99497 7.77059 7.91182 7.81324C5.23116 7.85463 2.72337 9.40875 1.34796 11.8221C-1.49053 16.7428 0.626442 23.9741 3.34593 27.9516C4.7063 29.8995 6.29591 32.0746 8.37655 31.998C10.4121 31.914 11.1725 30.6986 13.6289 30.6986C16.0628 30.6986 16.7768 31.998 18.8988 31.9491C21.0834 31.914 22.4588 29.9924 23.7715 28.0268C25.3436 25.7941 25.9749 23.5953 26 23.4824C25.9486 23.4648 21.7573 21.863 21.716 17.0175Z" fill="white"/>
                                                <path d="M17.7075 5.12897C18.8023 3.75798 19.5514 1.89279 19.3434 0C17.7589 0.0702427 15.7772 1.09754 14.636 2.43842C13.6264 3.62001 12.7245 5.5567 12.9575 7.37799C14.7375 7.51095 16.5651 6.47863 17.7075 5.12897Z" fill="white"/>
                                            </svg>
                                        </a>
                                    </div>
                                </div>

                            </div>
                        </div>
                    </div>

                    <hr className='border-[3px] border-[#808080] rounded-lg my-14' />
                </div>
            </footer>


        </>
    );
}

export default MainScreen;
